src/Catalogs/Scan_ВидыТахографов/Scan_ВидыТахографов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ВидыТахографов</name>
  <predefined>
    <items>
      <name>Штрих</name>
      <description>1</description>
    </items>
    <items>
      <name>A</name>
      <description>A</description>
    </items>
    <items>
      <name>B</name>
      <description>B</description>
    </items>
    <items>
      <name>E</name>
      <description>E</description>
    </items>
    <items>
      <name>F</name>
      <description>F</description>
    </items>
    <items>
      <name>G</name>
      <description>G</description>
    </items>
    <items>
      <name>H</name>
      <description>H</description>
    </items>
    <items>
      <name>J</name>
      <description>J</description>
    </items>
    <items>
      <name>K</name>
      <description>K</description>
    </items>
    <items>
      <name>L</name>
      <description>L</description>
    </items>
    <items>
      <name>N</name>
      <description>N</description>
    </items>
    <items>
      <name>P</name>
      <description>P</description>
    </items>
    <items>
      <name>Q</name>
      <description>Q</description>
    </items>
    <items>
      <name>R</name>
      <description>R</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_ВидыТахографов/ManagerModule.bsl
// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.A.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="7-дневный";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 
	
	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.B.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="1-дневный VDO";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 
	
	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.E.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="цифровой STONERIDGE SE5000 Exact Duo";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 
	
	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.F.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="цифровой ADR STONERIDGE";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 
	
	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.G.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="цифровой ADR Continental";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 
	
	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.H.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="7 day with record sheet Japan";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 
	
	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.J.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="подготовка под российский тахограф ""Штрих"" (с пп 9.3)";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 
	
	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.K.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="Digital data recorder China";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 
	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.L.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="цифровой, Siemens VDO";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 

	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.N.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="1-дневный,  исп. ADR";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 

	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.P.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="1-дневный,  исп. ADR, D8";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 

	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.Q.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="1-day rec sheet 1390";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 

	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.R.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="подготовка под российский тахограф ""Штрих"" (до пп 9.3)";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 

	// rarus tenkam 22.03.2018 mantis 9428 +++	
	РасшифровкаОбъект=Справочники.Scan_ВидыТахографов.Штрих.ПолучитьОбъект();
	РасшифровкаОбъект.Расшифровка="Штрих";
	РасшифровкаОбъект.ОбменДанными.Загрузка=Истина;

	Попытка
		РасшифровкаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, РасшифровкаОбъект, ОписаниеОшибки());
	КонецПопытки; 
	// rarus tenkam 22.03.2018 mantis 9428 ---
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

//rarus kolg 27.11.2017 TLMS 9428 ++
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Попытка
	
		Представление = Данные.Наименование + " - " + Данные.Ссылка.Расшифровка;
		СтандартнаяОбработка = Ложь;
				
	Исключение
	
	КонецПопытки;
		
КонецПроцедуры
//rarus kolg 27.11.2017 TLMS 9428 --
